# Customer Segmentation using K-Means Algorithm

- Customer segmentation simply means grouping your customers according to various characteristics (for example grouping customers by age).

- One very common machine learning algorithm that's suitable for customer segmentation problems is the K-Means clustering algorithm.

## Importing Libraries

In [1]:
import numpy as np 
import pandas as pd

import plotly as py
import plotly.graph_objs as go

from sklearn.cluster import KMeans

import matplotlib.pyplot as plt
import seaborn as sns

import warnings
warnings.filterwarnings("ignore")

# import warnings
# warnings.filterwarnings("ignore", category=DeprecationWarning)

## Data Exploration

In [2]:
df = pd.read_csv('D:/AMIR/Programming/Data Analyst/Customer Segmentation using K-Means Algorithm/Mall_Customers.csv')

In [3]:
df.head()

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [4]:
df.shape

(200, 5)

In [5]:
df.describecribe()

       CustomerID         Age  Annual Income (k$)  Spending Score (1-100)
count  200.000000  200.000000          200.000000              200.000000
mean   100.500000   38.850000           60.560000               50.200000
std     57.879185   13.969007           26.264721               25.823522
min      1.000000   18.000000           15.000000                1.000000
25%     50.750000   28.750000           41.500000               34.750000
50%    100.500000   36.000000           61.500000               50.000000
75%    150.250000   49.000000           78.000000               73.000000
max    200.000000   70.000000          137.000000               99.000000

In [7]:
df.dtypes

CustomerID                 int64
Genre                     object
Age                        int64
Annual Income (k$)         int64
Spending Score (1-100)     int64
dtype: object

In [8]:
df.isnull().sum()

CustomerID                0
Genre                     0
Age                       0
Annual Income (k$)        0
Spending Score (1-100)    0
dtype: int64